Revit 2024 API
ExternalService Methods
The ExternalService type exposes the following members.
Methods
Name | Description
AddServer
 Registers a server with its service.
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetDefaultServerId
 Returns the Id of the default server if one was assigned to the service.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetOptions
 A copy of the options the service was registered with.
GetPublicAccessKey
 Access key to use to execute a service.
GetRegisteredServerIds
 Returns Ids of all servers registered for the service.
GetServer
 Returns the instance that provides implementation for a registered server.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
IsRegisteredServerId
 Checks if the Id represents a valid server that has been registered for the service.
RemoveServer
 Removes/unregisters a server from the service.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
ExternalService Class
Autodesk.Revit.DB.ExternalService Namespace